# Формат файла `.quiz.md`

Файл `.quiz.md` — единственный формат для импорта тестов в Quiz Core. Это обычный Markdown с YAML-заголовком и несколькими соглашениями для разметки вопросов и ответов. Файл можно писать в любом текстовом редакторе, а Markdown-превью (VS Code, GitHub) покажет читаемый текст.

---

## Структура файла

```
---
YAML-заголовок (метаданные теста)
---

### Вопрос 1

текст вопроса, варианты ответов, пояснение

---

### Вопрос 2

...
```

---

## YAML-заголовок

Обязательные и опциональные поля метаданных, заключённые между `---`:

| Поле                | Тип     | Обязательное | По умолчанию | Описание                                            |
| ------------------- | ------- | ------------ | ------------ | --------------------------------------------------- |
| `title`             | строка  | да           | —            | Название теста                                      |
| `time_limit`        | число   | нет          | нет лимита   | Ограничение по времени на весь тест (в минутах)     |
| `shuffle_questions` | boolean | нет          | `false`      | Перемешивать порядок вопросов для каждого ученика    |
| `shuffle_answers`   | boolean | нет          | `false`      | Перемешивать порядок вариантов ответов               |

Пример:

```yaml
---
title: "Перестановки, размещения, сочетания"
time_limit: 30
shuffle_questions: true
shuffle_answers: true
---
```

---

## Вопросы

Вопросы разделяются горизонтальной линией (`---`). Каждый вопрос начинается с заголовка третьего уровня (`###`).

### Заголовок вопроса

```markdown
### Название вопроса (любой текст)
```

Номер вопроса назначается автоматически при импорте — вы можете свободно менять порядок вопросов в файле.

---

## Типы вопросов

Тип определяется **автоматически** по содержимому:

### 1. Одиночный выбор (single choice)

Если среди вариантов ровно **один** отмечен `[x]`:

```markdown
### Какой ответ правильный?

Текст вопроса с формулой $a^2 + b^2 = c^2$.

- [ ] Неправильный вариант A
- [x] Правильный вариант B
- [ ] Неправильный вариант C
- [ ] Неправильный вариант D

> Пояснение: B — правильный, потому что...
```

### 2. Множественный выбор (multiple choice)

Если **несколько** вариантов отмечены `[x]`:

```markdown
### Выберите все верные утверждения

Какие равенства верны?

- [x] $A_n^k = C_n^k \cdot k!$
- [ ] $C_n^k = \frac{A_n^k}{(n-k)!}$
- [x] $C_n^k = \frac{A_n^k}{k!}$
- [ ] $A_n^k = C_n^k + k!$

> Из формулы следует, что верны варианты 1 и 3.
```

Оценка: **всё или ничего** — нужно выбрать в точности правильный набор.

### 3. Краткий ответ (short answer)

Если нет вариантов (`- [ ]` / `- [x]`), а есть строка `answer:`:

```markdown
### Перестановки с повторениями

Сколько различных перестановок у слова «ананас»?

answer: 60

> Формула: $\frac{6!}{3! \cdot 2!} = 60$.
```

Несколько допустимых ответов через запятую:

```markdown
answer: Москва, москва
```

Сравнение — **точное совпадение** (с обрезкой пробелов по краям).

---

## Разметка содержимого

### LaTeX-формулы

Используйте стандартные LaTeX-разделители:

- Инлайн: `$C_n^k$` → $C_n^k$
- Блочная: `$$\sum_{i=1}^{n} i = \frac{n(n+1)}{2}$$`

Формулы работают в тексте вопроса, в вариантах ответа и в пояснениях.

### Блоки кода

Стандартные ограждённые блоки с указанием языка:

````markdown
```cpp
#include <iostream>
int main() {
    std::cout << 42;
    return 0;
}
```
````

Поддерживаемые языки для подсветки: `cpp`, `c`, `python`. Блоки кода можно размещать в тексте вопроса — они не влияют на парсинг вариантов ответа.

### Пояснения

Необязательный блок цитаты (`>`) после вариантов ответа или строки `answer:`. Показывается ученикам только когда преподаватель включает отображение результатов.

```markdown
> Это пояснение. Может быть многострочным.
> Вторая строка пояснения.
```

### Баллы за вопрос

По умолчанию каждый вопрос стоит **1 балл**. Для изменения добавьте строку `points:` перед текстом вопроса:

```markdown
### Сложный вопрос

points: 3

Текст вопроса...

- [x] Правильный
- [ ] Неправильный
```

---

## Полный пример

```markdown
---
title: "Перестановки, размещения, сочетания, next permutation, ПСП"
time_limit: 30
shuffle_questions: true
shuffle_answers: true
---

### Размещения и сочетания

В каком из объектов порядок выбранных элементов из $n$ по $k$ учитывается?

- [ ] В сочетаниях $C_n^k$
- [x] В размещениях $A_n^k$
- [ ] В количестве подмножеств $2^n$
- [ ] В числе Каталана

> В размещениях порядок важен, а в сочетаниях — нет.

---

### Связь размещений и сочетаний (Средний уровень)

Какие равенства верны? (выберите все верные)

- [x] $A_n^k = C_n^k \cdot k!$
- [ ] $C_n^k = \frac{A_n^k}{(n - k)!}$
- [x] $C_n^k = \frac{A_n^k}{k!}$
- [ ] $A_n^k = C_n^k + k!$

> Из формулы $A_n^k = C_n^k \cdot k!$ сразу следует $C_n^k = \frac{A_n^k}{k!}$.

---

### Перестановки с повторениями (Средний уровень)

Сколько различных перестановок у слова «ананас»?

answer: 60

> Формула: $\frac{6!}{3! \cdot 2!} = 60$.

---

### Генерация перестановок рекурсией (Средний уровень)

В алгоритме генерации перестановок через обмены:

```cpp
void permute(vector<int>& a, int pos) {
    if (pos == a.size()) { print(a); return; }
    for (int j = pos; j < a.size(); j++) {
        swap(a[pos], a[j]);
        permute(a, pos + 1);
        // что здесь?
    }
}
```

Что нужно сделать после возврата из рекурсивного вызова?

- [ ] Отсортировать суффикс
- [x] Выполнить обратный обмен тех же элементов
- [ ] Удалить последний элемент
- [ ] Ничего не делать

> Нужно откатить состояние (backtracking).




---

## Краткая справка

| Элемент              | Синтаксис                         |
| -------------------- | --------------------------------- |
| Метаданные           | YAML между `---`                  |
| Разделитель вопросов | `---` (горизонтальная линия)      |
| Заголовок вопроса    | `### Текст`                       |
| Верный вариант       | `- [x] текст`                     |
| Неверный вариант     | `- [ ] текст`                     |
| Краткий ответ        | `answer: значение`                |
| Несколько ответов    | `answer: a, b, c`                 |
| Баллы                | `points: N`                       |
| Пояснение            | `> текст`                         |
| Инлайн-формула       | `$...$`                           |
| Блочная формула      | `$$...$$`                         |
| Блок кода            | ` ```язык ... ``` `               |
